clc
close all
clear
V1=28*ones(1,5);%发送车CM速度
V2=[30,30,30,30,30];%接收车CH速度
v=zeros(5,5);%车与车之间的相对速度矩阵
h=zeros(5,5);%车与车之间的先前时刻的值
g=zeros(5,5);%误差，服从参数为1指数分布
G=zeros(5,5);%车与车之间信道增益矩阵
I=zeros(5,5);%车与车之间干扰信道增益矩阵（对角线全为0元素，因为对角线是有效信道增益）
for i=1:5
    for j=1:5
        v(i,j)=abs(V1(i)-V2(j));
        h(i,j)=1+0.3*rand(1);
    end
end%构造速度还有h矩阵
% [6,1,4,0,3;0,7,2,6,9;8,1,6,2,1;10,3,8,4,1;0,7,2,6,9];相对速度矩阵
%h=[0.845418353066450,0.995224514302217,0.687960311535798,0.741632431164121,0.706496751675251;0.716599213586070,0.675355816604331,0.609143849450247,0.779761672779394,0.697456077357881;0.947490617895953,0.811444306977048,0.965654067256766,0.989572070823563,0.834170383464932;0.647590153069472,0.970613035572538,0.837424308992463,0.953446121969907,0.769790372435062;0.842902954353616,0.628305432990921,0.969908972473279,0.856831766456680,0.641799867159030];
h=[1.21026765186132,1.00186773622345,1.11230368038275,1.27044868578780,1.09550344842318;1.17912487696444,1.08933855474170,1.03750431438572,1.11650670059712,1.24530632319216;1.29435271127300,1.25859695058615,1.02514626462880,1.10131359710114,1.07083874991164;1.09534161637965,1.29533452164231,1.16447526737693,1.22477537780633,1.25255552041723;1.05006691209611,1.27092928278688,1.03153723834667,1.22352792893222,1.21881158135137];
Delta=1e-6;%背景噪声
T=0.001;%所有车与车移动信道CSI采样周期（V2V）
c=3*1e+8;%光速
fc=5.9*1e+9;%多普勒频移中心频率
j1=2*pi*fc*T/c*v;%0阶贝塞尔函数参数（V2V）
epsi=besselj(0,j1);%求贝塞尔函数值（V2V）
a=(epsi.^2).*h;%车车通信移动信道快衰落的模型中的CSI反馈部分（先前时刻的信道状态信息）
l=0.0001;%车车通信慢衰落系数
G1=l*a;%车车通信衰落（先前时刻的信道增益（也是测得的平均信道增益））
G2=l*(1-epsi.^2);%车车通信信道衰落误差部分的平均信道增益G=G1+G2;%车车通信总的平均信道增益矩阵（该矩阵用于求取平均信噪比，长期速率和）

MUk=0.5;
alfak=l*(1-epsi.^2);
betak=l*(1-epsi.^2);
X=G1+MUk*alfak+betak;%xi部分
SIGMA=0.5;
E=0.1;%中断概率伊普西路1
H=X+SIGMA*sqrt(-2*log(E))*alfak; %贝恩斯坦近似后的干扰表示
    for i=1:5
      I(i,i)=0;
    end%构造干扰约束中的系数矩阵,让对角线为0

global N
N =25;
arfa=zeros(N,5);
beta=zeros(N,5);
SINR=zeros(N,5);
Pmax=log(0.5)*ones(N,5);
B=1;
C1=linspace(1,1,5);
S=zeros(N,5);
s=zeros(N,5);
Gama=0.1;%原来是
Ith=2e-6;%干扰阈值Gama要给相应的存储空间
Temp=zeros(40,5);%每次迭代收敛的最优功率暂存区 40应为Z
Z=1;

for sub1=1:100    
P=zeros(N,5);
P(1,:)=[-8,-8,-8,-8,-8]; 
% ----------——————————CVX begin——————————----------% 
%{
%}
cvx_begin
variable eta

for k=1:N
  for i=1:5
    I1(i)=exp(P(k,:))*G(:,i)+Delta-G(i,i)*exp(P(k,i));
    SINR(k,i)=G(i,i)*exp(P(k,i))/I1(i);   
    arfa(k,i)=SINR(k,i)/(1+SINR(k,i));
    Total_T(k)=B*dot(log(C1+SINR(k,:))/log(2),C1);
  end
end
eta =Total_T(k);
maximize(eta)

    
    
D(Z)=Total_T(N);   
error =abs(D(Z));
cvx_end
      if  error<=1e-3   
    break
      else
         Gama(Z+1)=D(Z)/(GF*exp(Temp(Z,:)')+PC); 
      end 
     Z=Z+1;
end %sub1 end
    


