clc ;                                                                                                                                                                         %如果爱有天意，我希望望舒可以回心转意，当时只道是寻常。    2021/5/26                                    
clear ;
close all;
Dtaylor=[1.13799793212138;31.8955217081034;34.6449488656280;34.8282109035642;34.9316514833143;34.9816514833143;34.9816514833143];
Dtaylor=Dtaylor*log(2);
Doriginal=[1.24142902216963;22.2968087951863;24.2076365686919;24.3257009310573;24.3424981714509;24.3424981714509;24.3424981714509];
figure(6);
plot(Dtaylor,'-^b','linewidth',1.5);
hold on
plot(Doriginal,'-^r','linewidth',1.5);
xlabel('Iteration');
ylabel('sum-rate (bps/Hz)');