clc
close all
clear
%-------------------系统参数-------------------%发送车速度32，30，34，34，30.相应的D2D对接收车32，30，34，34，30
V=[32,30,34,34,30];%发送车速度
v1=zeros(5,5);%车与车之间的相对速度矩阵
v2=zeros(1,5);%车与基站之间的相对速度矩阵
h1=zeros(5,5);%车与车之间的先前时刻的值
h2=zeros(1,5);%车与基站之间的先前时刻的值
g1=zeros(5,5);%误差，服从参数为1指数分布
g2=zeros(1,5);%误差，服从参数为1指数分布
G= zeros(5,5);%车与车之间信道增益矩阵
for i=1:5
    v2(i)=rand(1)*V(i);
    h2(i)=0.6+0.4*rand(1);
    g2(i)=min(exprnd(1),1);
    for j=1:5                              %每次数据发生改变
        v1(i,j)=abs(V(i)-V(j));
        h1(i,j)=0.6+0.4*rand(1);
        g1(i,j)=min(exprnd(1),1);
    end
end
T1=0.0001;%车与车移动信道CSI采样周期T1<T2,T2为车到基站移动信道的采样CSI（V2V）
T2=0.0005;%基站采集与之通信的发射车干扰信道链路的CSI周期(V2I)
c=3*1e+8;%光速
fc=5.9*1e+9;%多普勒频移中心频率
j1=2*pi*fc*T1/c*v1;%0阶贝塞尔函数参数（V2V）
j2=2*pi*fc*T2/c*v2;%0阶贝塞尔函数参数（V2I）
epsi1=besselj(0,j1);%求贝塞尔函数值（V2V）
epsi2=besselj(0,j2);%求贝塞尔函数值（V2I）
